## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_firewall.k8s-master-firewall will be created
  + resource "digitalocean_firewall" "k8s-master-firewall" {
      + created_at      = (known after apply)
      + droplet_ids     = [
          + 382715539,
        ]
      + id              = (known after apply)
      + name            = "k8s-master-firewall"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          + port_range                = "10250"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "10251"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "10252"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "100.64.0.0/10",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "2379-2380"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "6443"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
            # (1 unchanged attribute hidden)
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
    }

  # digitalocean_firewall.k8s-workers-firewall will be created
  + resource "digitalocean_firewall" "k8s-workers-firewall" {
      + created_at      = (known after apply)
      + droplet_ids     = [
          + 382719125,
          + 424407313,
        ]
      + id              = (known after apply)
      + name            = "k8s-workers-firewall"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          + port_range                = "10250"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "30000-32767"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
            # (1 unchanged attribute hidden)
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
    }

  # digitalocean_firewall.mysql-master-firewall will be created
  + resource "digitalocean_firewall" "mysql-master-firewall" {
      + created_at      = (known after apply)
      + droplet_ids     = [
          + 383025155,
        ]
      + id              = (known after apply)
      + name            = "mysql-master-firewall"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          + port_range                = "22"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "3306"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "10.118.0.0/20",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "443"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "103.21.244.0/22",
              + "103.22.200.0/22",
              + "103.31.4.0/22",
              + "104.16.0.0/13",
              + "104.24.0.0/14",
              + "108.162.192.0/18",
              + "131.0.72.0/22",
              + "141.101.64.0/18",
              + "162.158.0.0/15",
              + "172.64.0.0/13",
              + "173.245.48.0/20",
              + "188.114.96.0/20",
              + "190.93.240.0/20",
              + "197.234.240.0/22",
              + "198.41.128.0/17",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "80"
          + protocol                  = "tcp"
          + source_addresses          = [
              + "103.21.244.0/22",
              + "103.22.200.0/22",
              + "103.31.4.0/22",
              + "104.16.0.0/13",
              + "104.24.0.0/14",
              + "108.162.192.0/18",
              + "131.0.72.0/22",
              + "141.101.64.0/18",
              + "162.158.0.0/15",
              + "172.64.0.0/13",
              + "173.245.48.0/20",
              + "188.114.96.0/20",
              + "190.93.240.0/20",
              + "197.234.240.0/22",
              + "198.41.128.0/17",
            ]
          + source_droplet_ids        = []
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + protocol                       = "icmp"
            # (1 unchanged attribute hidden)
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>